/*
Расчет активности на основе выполнения индивидуальных заданий.
Структура записи по выполненным заданиям: код студента (номер зачетной книжки, номер задания, задача 1, задача 2, задача 3.
Балл за задачу: задача 1 – 10 баллов; задача 2 -20 баллов; задача 3 -60 баллов.
Операции
1)	Заполнение данных по заданному заданию заданного студента с клавиатуры.
2)	Вставить запись по студенту в начало таблицы.
3)	Удалить записи по заданному студенту.
4)	Сформировать таблицу с результатами выполнения заданий заданным студентом.
*/